src/test/resources/Emulation_Input/NewSystemTest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns="http://www.xmlns.walmartstores.com/DemandChain/ShoppingExperienceManagement/datatypes/CheckoutCustomerBasket/1.0/"
	xmlns:ns1="http://www.xmlns.walmartstores.com/Header/datatypes/MessageHeader/1.4/">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1"
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>SVCSamsInstantSaving</wsse:Username>
				<wsse:Password>qtayWn-wW7+%*NAbs1W1</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ns:checkoutCustomerBasketRequest>
			<ns:messageHeader>
				<ns1:SubId>S[B@16541654</ns1:SubId>
				<ns1:CnsmrId>C[B@7bdd7bdd</ns1:CnsmrId>
				<ns1:SrvcNm>CheckoutCustomerBasket.checkoutCustomerBasket</ns1:SrvcNm>
				<ns1:TranId>255</ns1:TranId>
				<ns1:SrcSysId>POS</ns1:SrcSysId>
				<ns1:Version>1.0</ns1:Version>
			</ns:messageHeader>
			<ns:messageBody>
				<ns:customerBasket>
					<ns:basketID>0808</ns:basketID>
					<ns:createTimestamp>2020-03-10T14:29:23</ns:createTimestamp>
					<ns:customer>
						<ns:id>1010010131526022</ns:id>
					</ns:customer>
					<ns:subTotalAmount>
						<ns:value>1484</ns:value>
					</ns:subTotalAmount>
					<ns:orderLines>
						<ns:orderLine>
							<ns:lineNumber>1</ns:lineNumber>
							<ns:isPriceOverride>false</ns:isPriceOverride>
							<ns:quantity>
								<ns:amount>1</ns:amount>
							</ns:quantity>
							<ns:productOffering>
								<ns:id>11116</ns:id>
								<ns:price>
									<ns:amount>
										<ns:value>1484</ns:value>
									</ns:amount>
								</ns:price>
							</ns:productOffering>
						</ns:orderLine>
					</ns:orderLines>
					<ns:terminal>
						<ns:terminalID>0014</ns:terminalID>
					</ns:terminal>
					<ns:businessUnit>
						<ns:number>000005596</ns:number>
						<ns:country>
							<ns:code>US</ns:code>
						</ns:country>
					</ns:businessUnit>
					<ns:channel>
						<ns:code>1</ns:code>
						<ns:name>POS</ns:name>
					</ns:channel>
				</ns:customerBasket>
			</ns:messageBody>
		</ns:checkoutCustomerBasketRequest>
	</soapenv:Body>
</soapenv:Envelope>